# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [2]:
#Your code here; import the necessary packages
import sqlite3
import pandas as pd
conn=sqlite3.connect("data.sqlite")
cursor=conn.cursor()

In [3]:
#Your code here; create the connection and cursor

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [4]:
#Your code here; use a subquery. No join will be necessary.
query1='''select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       where customernumber in (select customernumber from orders
       where orderDate = '2003-01-31')'''
pd.read_sql_query(query1,conn)

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [30]:
#Your code here
query2= '''select productcode, productname, order_sum from products
join (select productcode, sum(quantityordered) as order_sum
from orderdetails group by productcode) using(productcode)
order by order_sum asc'''
pd.read_sql_query(query2,conn).head(2)

  productCode                 productName  order_sum
0    S18_4933       1957 Ford Thunderbird        767
1    S24_1046  1970 Chevy Chevelle SS 454        803

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [29]:
#Your code here
query3= '''select productname, count(distinct customernumber) as count from products
join (select productcode, ordernumber,customernumber from orderdetails join
(select ordernumber, customernumber from orders) using(ordernumber)) using(productcode)
group by productcode order by count desc'''
pd.read_sql_query(query3,conn).head(2)

                   productName  count
0  1992 Ferrari 360 Spider red     40
1     1952 Alpine Renault 1300     27

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [48]:
#Your code here
query4='''select employeenumber, E.officecode, city, firstname, lastname, count
from employees E, offices O, 
(select count(OO.customernumber) as count from employees E1, customers C, orders OO 
where E1.employeenumber = C.salesRepEmployeeNumber
AND OO.customernumber=C.customernumber group by E1.employeenumber) as T
where E.officecode=O.officecode AND T.count<=20
'''
pd.read_sql_query(query4,conn)

    employeeNumber officeCode           city firstName   lastName  count
0             1002          1  San Francisco     Diane     Murphy     14
1             1056          1  San Francisco      Mary  Patterson     14
2             1076          1  San Francisco      Jeff   Firrelli     14
3             1088          6         Sydney   William  Patterson     14
4             1102          4          Paris    Gerard     Bondur     14
5             1143          1  San Francisco   Anthony        Bow     14
6             1165          1  San Francisco    Leslie   Jennings     14
7             1166          1  San Francisco    Leslie   Thompson     14
8             1188          2         Boston     Julie   Firrelli     14
9             1216          2         Boston     Steve  Patterson     14
10            1286          3            NYC  Foon Yue      Tseng     14
11            1323          3            NYC    George     Vanauf     14
12            1337          4          Paris      Loui     Bondur     14
13            1370          4          Paris    Gerard  Hernandez     14
14            1401          4          Paris    Pamela   Castillo     14
15            1501          7         London     Larry       Bott     14
16            1504          7         London     Barry      Jones     14
17            1611          6         Sydney      Andy     Fixter     14
18            1612          6         Sydney     Peter      Marsh     14
19            1619          6         Sydney       Tom       King     14
20            1621          5          Tokyo      Mami      Nishi     14
21            1625          5          Tokyo   Yoshimi       Kato     14
22            1702          4          Paris    Martin     Gerard     14
23            1002          1  San Francisco     Diane     Murphy     14
24            1056          1  San Francisco      Mary  Patterson     14
25            1076          1  San Francisco      Jeff   Firrelli     14
26            1088          6         Sydney   William  Patterson     14
27            1102          4          Paris    Gerard     Bondur     14
28            1143          1  San Francisco   Anthony        Bow     14
29            1165          1  San Francisco    Leslie   Jennings     14
..             ...        ...            ...       ...        ...    ...
177           1504          7         London     Barry      Jones     16
178           1611          6         Sydney      Andy     Fixter     16
179           1612          6         Sydney     Peter      Marsh     16
180           1619          6         Sydney       Tom       King     16
181           1621          5          Tokyo      Mami      Nishi     16
182           1625          5          Tokyo   Yoshimi       Kato     16
183           1702          4          Paris    Martin     Gerard     16
184           1002          1  San Francisco     Diane     Murphy     12
185           1056          1  San Francisco      Mary  Patterson     12
186           1076          1  San Francisco      Jeff   Firrelli     12
187           1088          6         Sydney   William  Patterson     12
188           1102          4          Paris    Gerard     Bondur     12
189           1143          1  San Francisco   Anthony        Bow     12
190           1165          1  San Francisco    Leslie   Jennings     12
191           1166          1  San Francisco    Leslie   Thompson     12
192           1188          2         Boston     Julie   Firrelli     12
193           1216          2         Boston     Steve  Patterson     12
194           1286          3            NYC  Foon Yue      Tseng     12
195           1323          3            NYC    George     Vanauf     12
196           1337          4          Paris      Loui     Bondur     12
197           1370          4          Paris    Gerard  Hernandez     12
198           1401          4          Paris    Pamela   Castillo     12
199           1501          7         London     Larry       Bott     12
200           1504          7         London     Barry      Jones     12
201           1611          6         Sydney      Andy     Fixter     12
202           1612          6         Sydney     Peter      Marsh     12
203           1619          6         Sydney       Tom       King     12
204           1621          5          Tokyo      Mami      Nishi     12
205           1625          5          Tokyo   Yoshimi       Kato     12
206           1702          4          Paris    Martin     Gerard     12

[207 rows x 6 columns]

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here
query4='''select employeenumber, E.officecode, city, firstname, lastname, creditlimit
from employees E, offices O, 
(select ave(OO.creditlimit) as creditlimit from employees E1, customers C 
where E1.employeenumber = C.salesRepEmployeeNumber
group by customernumber) as T
where E.officecode=O.officecode AND T.creditlimit>
'''

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!